DataProcessors/ДиаграммаОтпусков.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<DataProcessor>
		<Properties>
			<Name>ДиаграммаОтпусков</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/ПлановыеЕжегодныеОтпуска.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ПлановыеЕжегодныеОтпуска</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Запланирован</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Перенесен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДокументПланирования</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ГрафикОтпусков</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоДней</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОтпуска</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыОтпусков</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьПеренесеннаяДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументПереноса</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПереносОтпуска</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Примечание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПеренесеннаяДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПеренесенноеКоличествоДней</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПеренесеннаяДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/СостоянияСотрудников.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>СостоянияСотрудников</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияСотрудника</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидВремени</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыИспользованияРабочегоВремени</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДействуетДо</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОкончаниеПредположительно</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СторнированиеНачислений</v8:Type>
						<v8:Type>cfg:DocumentRef.ИзменениеУсловийОплатыОтпускаПоУходуЗаРебенком</v8:Type>
						<v8:Type>cfg:DocumentRef.ПростойСотрудников</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтпускБезСохраненияОплатыСписком</v8:Type>
						<v8:Type>cfg:DocumentRef.Отпуск</v8:Type>
						<v8:Type>cfg:DocumentRef.БольничныйЛист</v8:Type>
						<v8:Type>cfg:DocumentRef.ПриостановлениеТрудовыхДоговоровКонтрактов</v8:Type>
						<v8:Type>cfg:DocumentRef.ОплатаПоСреднемуЗаработку</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтгулСписком</v8:Type>
						<v8:Type>cfg:DocumentRef.ВозобновлениеТрудовыхДоговоровКонтрактов</v8:Type>
						<v8:Type>cfg:DocumentRef.ОплатаДнейУходаЗаДетьмиИнвалидами</v8:Type>
						<v8:Type>cfg:DocumentRef.НачальнаяШтатнаяРасстановка</v8:Type>
						<v8:Type>cfg:DocumentRef.Увольнение</v8:Type>
						<v8:Type>cfg:DocumentRef.ВосстановлениеВДолжности</v8:Type>
						<v8:Type>cfg:DocumentRef.НазначениеПодработки</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтпускБезСохраненияОплаты</v8:Type>
						<v8:Type>cfg:DocumentRef.ВозвратИзОтпускаПоУходуЗаРебенком</v8:Type>
						<v8:Type>cfg:DocumentRef.ПрогулНеявка</v8:Type>
						<v8:Type>cfg:DocumentRef.ПрогулНеявкаСписком</v8:Type>
						<v8:Type>cfg:DocumentRef.ПрекращениеПодработки</v8:Type>
						<v8:Type>cfg:DocumentRef.ПриемНаРаботу</v8:Type>
						<v8:Type>cfg:DocumentRef.Командировка</v8:Type>
						<v8:Type>cfg:DocumentRef.УвольнениеСписком</v8:Type>
						<v8:Type>cfg:DocumentRef.Отгул</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтпускПоУходуЗаРебенком</v8:Type>
						<v8:Type>cfg:DocumentRef.ПриемНаРаботуСписком</v8:Type>
						<v8:Type>cfg:DocumentRef.ПереносДанных</v8:Type>
						<v8:Type>cfg:DocumentRef.ПериодыОплаченныеДоНачалаЭксплуатации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Год</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ДанныеСостоянийСотрудников.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ДанныеСостоянийСотрудников</Name>
			<Comment>Накапливает сведения для вычисления итогового набора состояний сотрудников</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ВидВремени</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыИспользованияРабочегоВремени</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОкончаниеПредположительно</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СторнированиеНачислений</v8:Type>
						<v8:Type>cfg:DocumentRef.ИзменениеУсловийОплатыОтпускаПоУходуЗаРебенком</v8:Type>
						<v8:Type>cfg:DocumentRef.ПростойСотрудников</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтпускБезСохраненияОплатыСписком</v8:Type>
						<v8:Type>cfg:DocumentRef.Отпуск</v8:Type>
						<v8:Type>cfg:DocumentRef.БольничныйЛист</v8:Type>
						<v8:Type>cfg:DocumentRef.ПриостановлениеТрудовыхДоговоровКонтрактов</v8:Type>
						<v8:Type>cfg:DocumentRef.ОплатаПоСреднемуЗаработку</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтгулСписком</v8:Type>
						<v8:Type>cfg:DocumentRef.ВозобновлениеТрудовыхДоговоровКонтрактов</v8:Type>
						<v8:Type>cfg:DocumentRef.ОплатаДнейУходаЗаДетьмиИнвалидами</v8:Type>
						<v8:Type>cfg:DocumentRef.НачальнаяШтатнаяРасстановка</v8:Type>
						<v8:Type>cfg:DocumentRef.Увольнение</v8:Type>
						<v8:Type>cfg:DocumentRef.ВосстановлениеВДолжности</v8:Type>
						<v8:Type>cfg:DocumentRef.НазначениеПодработки</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтпускБезСохраненияОплаты</v8:Type>
						<v8:Type>cfg:DocumentRef.ВозвратИзОтпускаПоУходуЗаРебенком</v8:Type>
						<v8:Type>cfg:DocumentRef.ПрогулНеявка</v8:Type>
						<v8:Type>cfg:DocumentRef.ПрогулНеявкаСписком</v8:Type>
						<v8:Type>cfg:DocumentRef.ПрекращениеПодработки</v8:Type>
						<v8:Type>cfg:DocumentRef.ПриемНаРаботу</v8:Type>
						<v8:Type>cfg:DocumentRef.Командировка</v8:Type>
						<v8:Type>cfg:DocumentRef.УвольнениеСписком</v8:Type>
						<v8:Type>cfg:DocumentRef.Отгул</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтпускПоУходуЗаРебенком</v8:Type>
						<v8:Type>cfg:DocumentRef.ПриемНаРаботуСписком</v8:Type>
						<v8:Type>cfg:DocumentRef.ПереносДанных</v8:Type>
						<v8:Type>cfg:DocumentRef.ПериодыОплаченныеДоНачалаЭксплуатации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сторно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияСотрудника</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Начало</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Окончание</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/СтатусыЗаявокСотрудников.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>СтатусыЗаявокСотрудников</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Согласовано</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Рассматривается</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отклонено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Подготовлено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отозвано</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/СостоянияЗаявокКабинетСотрудника.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>СостоянияЗаявокКабинетСотрудника</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Новая</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выполнена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отказ</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ОтменаЗаявкиНаОтпуск.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>ОтменаЗаявкиНаОтпуск</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаявкаСотрудника</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаявкаНаОтпуск</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыЗаявокСотрудников</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

DataProcessors/ДиаграммаОтпусков/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Формирует печатные формы.
//
// Параметры:
//	МассивОбъектов - Массив - ссылки на объекты, которые нужно распечатать.
//	ПараметрыПечати - Структура - дополнительные настройки печати.
//	КоллекцияПечатныхФорм - ТаблицаЗначений - сформированные табличные документы (выходной параметр).
//	ОбъектыПечати - СписокЗначений - значение - ссылка на объект
//		представление - имя области, в которой был выведен объект (выходной параметр).
//	ПараметрыВывода - Структура - дополнительные параметры сформированных табличных документов (выходной параметр).
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт

	ПечатнаяФорма = УправлениеПечатью.СведенияОПечатнойФорме(КоллекцияПечатныхФорм, "ДиаграммаОтпусков");
	Если ПечатнаяФорма <> Неопределено Тогда
		ПечатнаяФорма.ТабличныйДокумент = ПечатнаяФормаДиаграммыОтпусков(ПараметрыПечати.ИсходнаяДиаграмма,
			ПараметрыПечати.Заголовок);
		ПараметрыВывода.ЗаголовокФормы = ПараметрыПечати.Заголовок;
		ПараметрыВывода.Вставить("ОриентацияСтраницы", ОриентацияСтраницы.Ландшафт);
		ПечатнаяФорма.СинонимМакета = НСтр("ru = 'Диаграмма отпусков'");
		ПечатнаяФорма.ПолныйПутьКМакету = "Обработка.ДиаграммаОтпусков.ПФ_MXL_ДиаграммаОтпусков";
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Выполняет получение данных о периодах отпусков.
//
// Параметры:
//	Параметры - Структура - Набор параметров, необходимых для получения данных.
//
// Возвращаемое значение:
// - РезультатЗапроса
//
Функция ДанныеОтпусков(Параметры, ДополнительныйРезультат) Экспорт
	
	ТаблицаСотрудников = Новый ТаблицаЗначений;
	Схема = Параметры.Схема;
	НастройкиСхемыКомпоновки = Параметры.НастройкиСхемыКомпоновки;
	ЗарплатаКадрыОбщиеНаборыДанных.ЗаменитьПредставленияЗапросов(Схема.НаборыДанных, Схема);
	
	ПараметрНачалоПериода = НастройкиСхемыКомпоновки.ПараметрыДанных.Элементы.Найти("НачалоПериода");
	Если ПараметрНачалоПериода = Неопределено Тогда
		ПараметрНачалоПериода = НастройкиСхемыКомпоновки.ПараметрыДанных.Элементы.Добавить();
		ПараметрНачалоПериода.Параметр = Новый ПараметрКомпоновкиДанных("НачалоПериода");
	КонецЕсли;
	ПараметрНачалоПериода.Использование = Истина;
	ПараметрНачалоПериода.Значение = Параметры.НачалоПериода;
	
	ПараметрОкончаниеПериода = НастройкиСхемыКомпоновки.ПараметрыДанных.Элементы.Найти("ОкончаниеПериода");
	ПараметрОкончаниеПериода.Использование = Истина;
	ПараметрОкончаниеПериода.Значение = Параметры.ОкончаниеПериода;
	
	Если ТипЗнч(Параметры.ПодразделениеСотрудник) = Тип("СправочникСсылка.СтруктураПредприятия") Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(НастройкиСхемыКомпоновки.Отбор,
			"МестоВСтруктуреПредприятия", Параметры.ПодразделениеСотрудник, ВидСравненияКомпоновкиДанных.ВИерархии, ,
			ЗначениеЗаполнено(Параметры.ПодразделениеСотрудник));
	ИначеЕсли ТипЗнч(Параметры.ПодразделениеСотрудник) = Тип("СправочникСсылка.Сотрудники") Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(НастройкиСхемыКомпоновки.Отбор, "Сотрудник",
			Параметры.ПодразделениеСотрудник, ВидСравненияКомпоновкиДанных.Равно, ,
			ЗначениеЗаполнено(Параметры.ПодразделениеСотрудник));
	КонецЕсли;
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновкиДанных = КомпоновщикМакета.Выполнить(Схема, НастройкиСхемыКомпоновки, , ,
		Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновкиДанных);
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	ПроцессорВывода.УстановитьОбъект(ТаблицаСотрудников);
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);
	
	ПоместитьВоВременноеХранилище(ТаблицаСотрудников.Количество(), ДополнительныйРезультат);
	
	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	ЗарплатаКадры.СоздатьВТПоТаблицеЗначений(МенеджерВременныхТаблиц, ТаблицаСотрудников, "ВТСотрудники");
	Результат = РезультатЗапросаДанныхОтпусков(МенеджерВременныхТаблиц, Параметры);
	
	Возврат Результат;
	
КонецФункции

Функция ВидыОтпуска() Экспорт
	
	ВидыОтпуска = Новый Структура();
	ВидыОтпуска.Вставить("Отпуск", "Отпуск");
	ВидыОтпуска.Вставить("График", "График");
	ВидыОтпуска.Вставить("Заявка", "Заявка");
	ВидыОтпуска.Вставить("ЗаявкаНеСогласованная", "ЗаявкаНеСогласованная");
	
	Возврат ВидыОтпуска;
	
КонецФункции

Функция БазовыйПроизводственныйКалендарь() Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ПроизводственныеКалендари.БазовыйКалендарь
		|ИЗ
		|	Справочник.ПроизводственныеКалендари КАК ПроизводственныеКалендари
		|ГДЕ
		|	НЕ ПроизводственныеКалендари.ПометкаУдаления";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Количество() = 1 Тогда
		Результат = ВыборкаДетальныеЗаписи.БазовыйКалендарь;
	Иначе
		Результат = Справочники.ПроизводственныеКалендари.ПустаяСсылка();
	КонецЕсли;
	
	Возврат Результат;

КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция РезультатЗапросаДанныхОтпусков(МенеджерВременныхТаблиц, Параметры)

	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	ТекстЗапроса = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ПлановыеЕжегодныеОтпуска.Сотрудник КАК Сотрудник,
		|	ПлановыеЕжегодныеОтпуска.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ПлановыеЕжегодныеОтпуска.ДокументПланирования КАК Документ,
		|	ВЫБОР
		|		КОГДА ПлановыеЕжегодныеОтпуска.ПеренесеннаяДатаНачала = ДАТАВРЕМЯ(1, 1, 1)
		|			ТОГДА ПлановыеЕжегодныеОтпуска.ДатаНачала
		|		ИНАЧЕ ПлановыеЕжегодныеОтпуска.ПеренесеннаяДатаНачала
		|	КОНЕЦ КАК ДатаНачала,
		|	ВЫБОР
		|		КОГДА ПлановыеЕжегодныеОтпуска.ПеренесеннаяДатаОкончания = ДАТАВРЕМЯ(1, 1, 1)
		|			ТОГДА ПлановыеЕжегодныеОтпуска.ДатаОкончания
		|		ИНАЧЕ ПлановыеЕжегодныеОтпуска.ПеренесеннаяДатаОкончания
		|	КОНЕЦ КАК ДатаОкончания,
		|	ВЫБОР
		|		КОГДА ПлановыеЕжегодныеОтпуска.ПеренесенноеКоличествоДней = 0
		|			ТОГДА ПлановыеЕжегодныеОтпуска.КоличествоДней
		|		ИНАЧЕ ПлановыеЕжегодныеОтпуска.ПеренесенноеКоличествоДней
		|	КОНЕЦ КАК КоличествоДней,
		|	&ВидОтпускаГрафик КАК ВидОтпуска,
		|	0 КАК Приоритет
		|ПОМЕСТИТЬ ВТДанныеОтпусков
		|ИЗ
		|	РегистрСведений.ПлановыеЕжегодныеОтпуска КАК ПлановыеЕжегодныеОтпуска
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТСотрудники КАК Сотрудники
		|		ПО ПлановыеЕжегодныеОтпуска.Сотрудник = Сотрудники.Сотрудник
		|			И (Сотрудники.ДатаУвольнения = ДАТАВРЕМЯ(1, 1, 1)
		|				ИЛИ ВЫБОР
		|					КОГДА ПлановыеЕжегодныеОтпуска.ПеренесеннаяДатаНачала = ДАТАВРЕМЯ(1, 1, 1)
		|						ТОГДА ПлановыеЕжегодныеОтпуска.ДатаНачала
		|					ИНАЧЕ ПлановыеЕжегодныеОтпуска.ПеренесеннаяДатаНачала
		|				КОНЕЦ <= Сотрудники.ДатаУвольнения)
		|			И (&ОтображатьПлан)
		|ГДЕ
		|	ПлановыеЕжегодныеОтпуска.Запланирован
		|	И (ВЫБОР
		|				КОГДА ПлановыеЕжегодныеОтпуска.ПеренесеннаяДатаНачала = ДАТАВРЕМЯ(1, 1, 1)
		|					ТОГДА ПлановыеЕжегодныеОтпуска.ДатаНачала
		|				ИНАЧЕ ПлановыеЕжегодныеОтпуска.ПеренесеннаяДатаНачала
		|			КОНЕЦ МЕЖДУ &НачалоПериода И &ОкончаниеПериода
		|			ИЛИ ВЫБОР
		|				КОГДА ПлановыеЕжегодныеОтпуска.ПеренесеннаяДатаОкончания = ДАТАВРЕМЯ(1, 1, 1)
		|					ТОГДА ПлановыеЕжегодныеОтпуска.ДатаОкончания
		|				ИНАЧЕ ПлановыеЕжегодныеОтпуска.ПеренесеннаяДатаОкончания
		|			КОНЕЦ МЕЖДУ &НачалоПериода И &ОкончаниеПериода)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	СостоянияСотрудников.Сотрудник,
		|	Сотрудники.ФизическоеЛицо,
		|	ДанныеСостоянийСотрудников.ДокументОснование,
		|	ДанныеСостоянийСотрудников.Начало,
		|	ДанныеСостоянийСотрудников.Окончание,
		|	0,
		|	&ВидОтпускаОтпуск,
		|	1
		|ИЗ
		|	РегистрСведений.СостоянияСотрудников КАК СостоянияСотрудников
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеСостоянийСотрудников КАК ДанныеСостоянийСотрудников
		|		ПО СостоянияСотрудников.Сотрудник = ДанныеСостоянийСотрудников.Сотрудник
		|			И СостоянияСотрудников.Состояние = ДанныеСостоянийСотрудников.Состояние
		|			И СостоянияСотрудников.Период <= ДанныеСостоянийСотрудников.Окончание
		|			И (СостоянияСотрудников.ДействуетДо >= ДанныеСостоянийСотрудников.Начало
		|				ИЛИ СостоянияСотрудников.ДействуетДо = ДАТАВРЕМЯ(1, 1, 1))
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТСотрудники КАК Сотрудники
		|		ПО СостоянияСотрудников.Сотрудник = Сотрудники.Сотрудник
		|			И (&ОтображатьФакт)
		|ГДЕ
		|	(СостоянияСотрудников.Период МЕЖДУ &НачалоПериода И &ОкончаниеПериода
		|			ИЛИ СостоянияСотрудников.ДействуетДо МЕЖДУ &НачалоПериода И &ОкончаниеПериода)
		|	И СостоянияСотрудников.Состояние В(&Состояния)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	Сотрудники.Сотрудник,
		|	ЗаявкаНаОтпуск.ФизическоеЛицо,
		|	ЗаявкаНаОтпуск.Ссылка,
		|	ЗаявкаНаОтпуск.ДатаНачала,
		|	ЗаявкаНаОтпуск.ДатаОкончания,
		|	ЗаявкаНаОтпуск.КоличествоДней,
		|	ВЫБОР
		|		КОГДА ЗаявкаНаОтпуск.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыЗаявокСотрудников.Согласовано)
		|			ТОГДА &ВидОтпускаЗаявка
		|		ИНАЧЕ &ВидОтпускаЗаявкаНеСогласованная
		|	КОНЕЦ,
		|	1
		|ИЗ
		|	Документ.ЗаявкаНаОтпуск КАК ЗаявкаНаОтпуск
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Отпуск КАК Отпуск
		|		ПО ЗаявкаНаОтпуск.Ссылка = Отпуск.ЗаявкаСотрудника
		|			И (Отпуск.Проведен)
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТСотрудники КАК Сотрудники
		|		ПО ЗаявкаНаОтпуск.ФизическоеЛицо = Сотрудники.ФизическоеЛицо
		|			И (Сотрудники.ДатаУвольнения = ДАТАВРЕМЯ(1, 1, 1)
		|				ИЛИ Сотрудники.ДатаУвольнения >= ЗаявкаНаОтпуск.ДатаНачала)
		|			И (&ОтображатьФакт)
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ОтменаЗаявкиНаОтпуск КАК ОтменаЗаявкиНаОтпуск
		|		ПО ЗаявкаНаОтпуск.Ссылка = ОтменаЗаявкиНаОтпуск.ЗаявкаСотрудника
		|			И (ОтменаЗаявкиНаОтпуск.Проведен)
		|			И (ОтменаЗаявкиНаОтпуск.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыЗаявокСотрудников.Согласовано))
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаявкаНаОтпуск КАК ИсправляющаяЗаявкаНаОтпуск
		|		ПО ЗаявкаНаОтпуск.Ссылка = ИсправляющаяЗаявкаНаОтпуск.ИсправленныйДокумент
		|			И (ИсправляющаяЗаявкаНаОтпуск.Проведен)
		|ГДЕ
		|	ЗаявкаНаОтпуск.Проведен
		|	И Отпуск.Ссылка ЕСТЬ NULL
		|	И ОтменаЗаявкиНаОтпуск.Ссылка ЕСТЬ NULL
		|	И ИсправляющаяЗаявкаНаОтпуск.Ссылка ЕСТЬ NULL
		|	И (ЗаявкаНаОтпуск.ДатаНачала МЕЖДУ &НачалоПериода И &ОкончаниеПериода
		|			ИЛИ ЗаявкаНаОтпуск.ДатаОкончания МЕЖДУ &НачалоПериода И &ОкончаниеПериода)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка),
		|	ЗаявкаСотрудникаОтпуск.ФизическоеЛицо,
		|	ЗаявкаСотрудникаОтпуск.Ссылка,
		|	ЗаявкаСотрудникаОтпуск.ДатаНачалаОтпуска,
		|	ЗаявкаСотрудникаОтпуск.ДатаОкончанияОтпуска,
		|	ЗаявкаСотрудникаОтпуск.КоличествоДнейОтпуска,
		|	ВЫБОР
		|		КОГДА ЗаявкаСотрудникаОтпуск.ОтпускСогласован
		|			ТОГДА &ВидОтпускаЗаявка
		|		ИНАЧЕ &ВидОтпускаЗаявкаНеСогласованная
		|	КОНЕЦ,
		|	1
		|ИЗ
		|	БизнесПроцесс.ЗаявкаСотрудникаОтпуск КАК ЗаявкаСотрудникаОтпуск
		|		ЛЕВОЕ СОЕДИНЕНИЕ БизнесПроцесс.ЗаявкаСотрудникаОтпуск.Отпуска КАК ЗаявкаСотрудникаОтпускОтпуска
		|		ПО (ЗаявкаСотрудникаОтпускОтпуска.Ссылка = ЗаявкаСотрудникаОтпуск.Ссылка)
		|			И (ЗаявкаСотрудникаОтпускОтпуска.Отпуск.Проведен)
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТСотрудники КАК Сотрудники
		|		ПО ЗаявкаСотрудникаОтпуск.ФизическоеЛицо = Сотрудники.ФизическоеЛицо
		|			И (Сотрудники.ДатаУвольнения = ДАТАВРЕМЯ(1, 1, 1)
		|				ИЛИ Сотрудники.ДатаУвольнения >= ЗаявкаСотрудникаОтпуск.ДатаНачалаОтпуска)
		|			И (&ОтображатьФакт)
		|ГДЕ
		|	ЗаявкаСотрудникаОтпуск.Отпуск = НЕОПРЕДЕЛЕНО
		|	И ЗаявкаСотрудникаОтпускОтпуска.Отпуск ЕСТЬ NULL
		|	И ЗаявкаСотрудникаОтпуск.СостояниеЗаявки <> ЗНАЧЕНИЕ(Перечисление.СостоянияЗаявокКабинетСотрудника.Отказ)
		|	И (ЗаявкаСотрудникаОтпуск.ДатаНачалаОтпуска МЕЖДУ &НачалоПериода И &ОкончаниеПериода
		|			ИЛИ ЗаявкаСотрудникаОтпуск.ДатаОкончанияОтпуска МЕЖДУ &НачалоПериода И &ОкончаниеПериода)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Сотрудники.Сотрудник КАК Сотрудник,
		|	ПРЕДСТАВЛЕНИЕ(Сотрудники.Сотрудник) КАК СотрудникПредставление,
		|	Сотрудники.ФизическоеЛицо КАК ФизическоеЛицо,
		|	Сотрудники.МестоВСтруктуреПредприятияНаименование КАК МестоВСтруктуреПредприятияНаименование,
		|	Сотрудники.МестоВСтруктуреПредприятия КАК МестоВСтруктуреПредприятия,
		|	Сотрудники.ГрафикРаботы КАК ГрафикРаботы,
		|	Сотрудники.ФИОПолные КАК ФИОПолные,
		|	ДанныеОтпусков.ВидОтпуска КАК ВидОтпуска,
		|	ДанныеОтпусков.ДатаНачала КАК ДатаНачала,
		|	ДанныеОтпусков.ДатаОкончания КАК ДатаОкончания,
		|	ДанныеОтпусков.Документ КАК ДокументОснование,
		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ДанныеОтпусков.Документ) КАК ДокументОснованиеПредставление,
		|	ДанныеОтпусков.КоличествоДней КАК КоличествоДней,
		|	ДанныеОтпусков.Приоритет КАК Приоритет
		|ИЗ
		|	ВТСотрудники КАК Сотрудники
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТДанныеОтпусков КАК ДанныеОтпусков
		|		ПО (ВЫБОР
		|				КОГДА ДанныеОтпусков.Сотрудник = ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
		|					ТОГДА Сотрудники.ФизическоеЛицо = ДанныеОтпусков.ФизическоеЛицо
		|				ИНАЧЕ Сотрудники.Сотрудник = ДанныеОтпусков.Сотрудник
		|			КОНЕЦ)
		|
		|УПОРЯДОЧИТЬ ПО
		|	Сотрудники.ФИОПолные";
	
	
	СхемаЗапроса = Новый СхемаЗапроса;
	СхемаЗапроса.УстановитьТекстЗапроса(ТекстЗапроса);
	Пакет = СхемаЗапроса.ПакетЗапросов[1];
	
	ОтображатьИерархию = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Параметры, "ОтображатьИерархию", Ложь);
	
	Если ОтображатьИерархию Тогда
		ИтогПодразделение = Пакет.КонтрольныеТочкиИтогов.Добавить("МестоВСтруктуреПредприятия");
		ИтогПодразделение.ТипКонтрольнойТочки = ТипКонтрольнойТочкиСхемыЗапроса.Иерархия;
		Пакет.КонтрольныеТочкиИтогов.Добавить("ФизическоеЛицо");
	Иначе
		Пакет.Порядок.Добавить("Сотрудники.ФИОПолные");
	КонецЕсли;

	Запрос.Текст = СхемаЗапроса.ПолучитьТекстЗапроса();
	
	Состояния = Новый Массив;
	Состояния.Добавить(Перечисления.СостоянияСотрудника.ОтпускОсновной);
	Состояния.Добавить(Перечисления.СостоянияСотрудника.ДополнительныйОтпуск);
	Состояния.Добавить(Перечисления.СостоянияСотрудника.ДополнительныйОтпускНеоплачиваемый);
	Состояния.Добавить(Перечисления.СостоянияСотрудника.ОтпускПоБеременностиИРодам);
	Состояния.Добавить(Перечисления.СостоянияСотрудника.ОтпускПоУходуЗаРебенком);
	Состояния.Добавить(Перечисления.СостоянияСотрудника.ОтпускУчебныйНеоплачиваемый);
	Состояния.Добавить(Перечисления.СостоянияСотрудника.ОтпускУчебныйОплачиваемый);
	
	ВидыОтпуска = ВидыОтпуска();
	Запрос.УстановитьПараметр("НачалоПериода", Параметры.НачалоПериода);
	Запрос.УстановитьПараметр("ОкончаниеПериода", Параметры.ОкончаниеПериода);
	Запрос.УстановитьПараметр("Состояния", Состояния);
	Запрос.УстановитьПараметр("ОтображатьФакт", Параметры.ОтображатьФакт);
	Запрос.УстановитьПараметр("ОтображатьПлан", Параметры.ОтображатьПлан);
	Запрос.УстановитьПараметр("ВидОтпускаГрафик", ВидыОтпуска.График);
	Запрос.УстановитьПараметр("ВидОтпускаОтпуск", ВидыОтпуска.Отпуск);
	Запрос.УстановитьПараметр("ВидОтпускаЗаявка", ВидыОтпуска.Заявка);
	Запрос.УстановитьПараметр("ВидОтпускаЗаявкаНеСогласованная", ВидыОтпуска.ЗаявкаНеСогласованная);
	
	Если ОтображатьИерархию Тогда
		// Добавляем сортировку списка сотрудников из настроек.
		ПсевдонимыТаблиц = Новый Соответствие;
		ПсевдонимыТаблиц.Вставить("Справочник.ПодразделенияОрганизаций", "Сотрудники");
		ПсевдонимыТаблиц.Вставить("Справочник.Должности", "Сотрудники");
		ПсевдонимыТаблиц.Вставить("Справочник.Сотрудники", "Сотрудники");
		ЗарплатаКадры.ДополнитьТекстЗапросаУпорядочиваниемСотрудников(Запрос, ПсевдонимыТаблиц);
	КонецЕсли;
	
	Результат = Запрос.Выполнить();
	
	Возврат Результат;
	
КонецФункции

Функция ПечатнаяФормаДиаграммыОтпусков(ИсходнаяДиаграмма, Заголовок)
	
	ОбработкаОбъект = Обработки.ДиаграммаОтпусков.Создать();
	ОбработкаОбъект.ИсходнаяДиаграмма = ИсходнаяДиаграмма;
	ТабличныйДокумент = ОбработкаОбъект.ДиаграммаГантаДляПечати(Заголовок);
	ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	ТабличныйДокумент.АвтоМасштаб = Истина;
	
	Возврат ТабличныйДокумент;
	
КонецФункции

#КонецОбласти

#КонецЕсли
